{
	"version": "https://jsonfeed.org/version/1",
	"title": "Stuart Malone",
	"icon": "https://micro.blog/samalone/avatar.jpg",
	"home_page_url": "https://blog.llamagraphics.com/",
	"feed_url": "https://blog.llamagraphics.com/feed.json",
	"items": [
		
			{
				"id": "http://samalone.micro.blog/2023/12/12/new-taskutilities-library.html",
				"title": "New TaskUtilities library for Swift",
				"content_html": "<p>Today, I published a new Swift library called <a href=\"https://github.com/samalone/task-utilities\">TaskUtilities</a>, containing code that was originally in my <a href=\"https://github.com/samalone/websocket-actor-system\">WebSocketActors</a> library. This library serves two purposes:</p>\n<h3 id=\"understanding-task-structure\">Understanding task structure</h3>\n<p>In complex asynchronous code, it is sometimes difficult to know what task is currently running and where it originated.  <code>TaskPath</code> lets you name a task and then retrieve the current task name from an arbitrary point in your code.</p>\n<div class=\"highlight\"><pre tabindex=\"0\" style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"><code class=\"language-swift\" data-lang=\"swift\">Task.detached {\n    TaskPath.with(name: <span style=\"color:#e6db74\">&#34;Fetch image&#34;</span>) {\n        ...\n        TaskPath.with(name: <span style=\"color:#e6db74\">&#34;Constructing request&#34;</span>) {\n            ...\n        }\n    }\n}\n\n<span style=\"color:#75715e\">// In other code called from the inner task:</span>\nprint(TaskPath.current) <span style=\"color:#75715e\">// Prints &#34;{Task Fetch image &gt; Constructing request}&#34;</span>\n</code></pre></div><h3 id=\"making-synchronous-code-async-safe\">Making synchronous code async-safe</h3>\n<p>If synchronous code like a class has mutable state, it is not safe to call that code from asynchronous tasks. The preferred way to solve this problem is to change the class into an actor, but there are situations where that may not be possible because the code must be called from a synchronous context.</p>\n<p>In these situations, <code>RecursiveTaskLock</code> and <code>LockedValue</code> provide a way to ensure that the mutable state is only accessed from one task at a time.</p>\n<h3 id=\"taskutilities\">TaskUtilities</h3>\n<p>If these features sound helpful, please give my <a href=\"https://github.com/samalone/task-utilities\">TaskUtilities</a> project a try. I look forward to your feedback!</p>\n",
				"content_text": "Today, I published a new Swift library called [TaskUtilities](https://github.com/samalone/task-utilities), containing code that was originally in my [WebSocketActors](https://github.com/samalone/websocket-actor-system) library. This library serves two purposes:\n\n### Understanding task structure\n\nIn complex asynchronous code, it is sometimes difficult to know what task is currently running and where it originated.  `TaskPath` lets you name a task and then retrieve the current task name from an arbitrary point in your code.\n\n```swift\nTask.detached {\n    TaskPath.with(name: \"Fetch image\") {\n        ...\n        TaskPath.with(name: \"Constructing request\") {\n            ...\n        }\n    }\n}\n\n// In other code called from the inner task:\nprint(TaskPath.current) // Prints \"{Task Fetch image > Constructing request}\"\n```\n\n### Making synchronous code async-safe\n\nIf synchronous code like a class has mutable state, it is not safe to call that code from asynchronous tasks. The preferred way to solve this problem is to change the class into an actor, but there are situations where that may not be possible because the code must be called from a synchronous context.\n\nIn these situations, `RecursiveTaskLock` and `LockedValue` provide a way to ensure that the mutable state is only accessed from one task at a time.\n\n### TaskUtilities\n\nIf these features sound helpful, please give my [TaskUtilities](https://github.com/samalone/task-utilities) project a try. I look forward to your feedback!\n",
				"date_published": "2023-12-12T10:50:32-05:00",
				"url": "https://blog.llamagraphics.com/2023/12/12/new-taskutilities-library.html"
			},
			{
				"id": "http://samalone.micro.blog/2023/12/02/in-praise-of.html",
				"title": "In praise of Swift's distributed actors",
				"content_html": "<p>At WWDC 2022, Apple introduced a new technology in Swift that I don&rsquo;t think got enough attention: <a href=\"https://developer.apple.com/wwdc22/110356\">distributed actors</a>. I&rsquo;ve been working with this system in my iOS app <a href=\"https://llamagraphics.com/proper-course\">Proper Course™</a>, and it has many benefits for the solo programmer working on an iOS app that requires a server component.</p>\n<h3 id=\"the-traditional-way\">The traditional way</h3>\n<p>The traditional way of creating a client-server application is to build a REST-ful API server using Swagger/OpenAPI, and then build your client app on top of that API. This makes sense if your server will have multiple clients written in different languages, and there are some really great technologies like <a href=\"https://vapor.codes\">Vapor</a> and <a href=\"https://github.com/apple/swift-openapi-generator\">Swift OpenAPI Generator</a> that make this job easier. These are great tools to build on if you need a public API for your server.</p>\n<p>But if you are an independent developer focused on creating an iOS app, the OpenAPI approach adds a lot of overhead and indirection that can really slow down development. Developing and maintaining the OpenAPI interface becomes a project of its own, and requires learning tools and workflows that don&rsquo;t really add value to your iOS application.</p>\n<p>Is there something better?</p>\n<h3 id=\"distributed-actors-to-the-rescue\">Distributed actors to the rescue</h3>\n<p>What if you could write entirely in Swift, make Swift function calls between your client and your server, develop them both in the same Xcode workspace, and have the compiler alert you immediately to any problems?</p>\n<p>This is exactly what distributed actors do, and it&rsquo;s pretty glorious.</p>\n<h3 id=\"getting-started\">Getting started</h3>\n<p>Before you start using distributed actors, you need to be comfortable with <a href=\"https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/\">Swift concurrency</a> in general and <a href=\"https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Actors\">actors</a> in particular. If you&rsquo;re already using actors in your code, adding distributed actors is pretty easy.</p>\n<p>To use distributed actors, you need a Swift library that provides an <em>actor system</em> with the communications infrastructure for your distributed actors. Apple has a <a href=\"https://github.com/apple/swift-distributed-actors\">peer-to-peer cluster actor system</a> library, but this is designed for scaling distributed servers. For a client-server application, you need a library that is designed for that purpose.</p>\n<p>Apple provides a sample project called <a href=\"https://developer.apple.com/documentation/swift/tictacfish_implementing_a_game_using_distributed_actors\">TicTacFish</a> that includes a client-server actor system based on WebSockets, but this sample code is missing some features that you will probably need in a real application. To support my own application, I&rsquo;ve taken that code and created an open-source library that enhances Apple&rsquo;s sample code with:</p>\n<ul>\n<li>Simultaneous connections to multiple servers &amp; clients</li>\n<li>Automatic reconnection after network failures</li>\n<li>Server calls to client actors (server push)</li>\n<li>Logging with Swift Logging</li>\n</ul>\n<p>If you would like to use distributed actors in your own Swift project, I encourage you to try my <a href=\"https://github.com/samalone/websocket-actor-system\">WebSocketActors</a> library on GitHub. The library is very new, but the main features are in place, and I&rsquo;d love to get feedback and answer questions.</p>\n",
				"content_text": "At WWDC 2022, Apple introduced a new technology in Swift that I don't think got enough attention: [distributed actors](https://developer.apple.com/wwdc22/110356). I've been working with this system in my iOS app [Proper Course™](https://llamagraphics.com/proper-course), and it has many benefits for the solo programmer working on an iOS app that requires a server component.\n\n### The traditional way\n\nThe traditional way of creating a client-server application is to build a REST-ful API server using Swagger/OpenAPI, and then build your client app on top of that API. This makes sense if your server will have multiple clients written in different languages, and there are some really great technologies like [Vapor](https://vapor.codes) and [Swift OpenAPI Generator](https://github.com/apple/swift-openapi-generator) that make this job easier. These are great tools to build on if you need a public API for your server.\n\nBut if you are an independent developer focused on creating an iOS app, the OpenAPI approach adds a lot of overhead and indirection that can really slow down development. Developing and maintaining the OpenAPI interface becomes a project of its own, and requires learning tools and workflows that don't really add value to your iOS application.\n\nIs there something better?\n\n### Distributed actors to the rescue\n\nWhat if you could write entirely in Swift, make Swift function calls between your client and your server, develop them both in the same Xcode workspace, and have the compiler alert you immediately to any problems?\n\nThis is exactly what distributed actors do, and it's pretty glorious.\n\n### Getting started\n\nBefore you start using distributed actors, you need to be comfortable with [Swift concurrency](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/) in general and [actors](https://docs.swift.org/swift-book/documentation/the-swift-programming-language/concurrency/#Actors) in particular. If you're already using actors in your code, adding distributed actors is pretty easy.\n\nTo use distributed actors, you need a Swift library that provides an _actor system_ with the communications infrastructure for your distributed actors. Apple has a [peer-to-peer cluster actor system](https://github.com/apple/swift-distributed-actors) library, but this is designed for scaling distributed servers. For a client-server application, you need a library that is designed for that purpose.\n\nApple provides a sample project called [TicTacFish](https://developer.apple.com/documentation/swift/tictacfish_implementing_a_game_using_distributed_actors) that includes a client-server actor system based on WebSockets, but this sample code is missing some features that you will probably need in a real application. To support my own application, I've taken that code and created an open-source library that enhances Apple's sample code with:\n\n- Simultaneous connections to multiple servers & clients\n- Automatic reconnection after network failures\n- Server calls to client actors (server push)\n- Logging with Swift Logging\n\nIf you would like to use distributed actors in your own Swift project, I encourage you to try my [WebSocketActors](https://github.com/samalone/websocket-actor-system) library on GitHub. The library is very new, but the main features are in place, and I'd love to get feedback and answer questions.\n",
				"date_published": "2023-12-02T10:42:48-05:00",
				"url": "https://blog.llamagraphics.com/2023/12/02/in-praise-of.html"
			}
	]
}
